Documents/ТК_ГрафикИнвентаризаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_ГрафикИнвентаризаций</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТК_ГрафикиИнвентаризаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикТорговыхОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыИнвентаризации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСклада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСкладов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтборов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыПоУмолчанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСклада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСкладов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтборов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТК_ГрафикИнвентаризаций/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ГрафикИнвентаризаций"));
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	
	// Таблица основные отборы
	Для ИндексСтроки = 0 По ТекущийОбъект.ОтборыПоУмолчанию.Количество()-1 Цикл 
		Объект.ОтборыПоУмолчанию[ИндексСтроки].Настройки = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекущийОбъект.ОтборыПоУмолчанию[ИндексСтроки].ХранилищеОтборов.Получить());
	КонецЦикла;

	// Таблица отборы по торговым площадкам
	Для ИндексСтроки = 0 По ТекущийОбъект.ОтборыИнвентаризации.Количество()-1 Цикл 
		Объект.ОтборыИнвентаризации[ИндексСтроки].Настройки = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекущийОбъект.ОтборыИнвентаризации[ИндексСтроки].ХранилищеОтборов.Получить());
	КонецЦикла;

	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Таблица основные отборы
	Для ИндексСтроки = 0 По Объект.ОтборыПоУмолчанию.Количество()-1 Цикл 
		ТекущийОбъект.ОтборыПоУмолчанию[ИндексСтроки].ХранилищеОтборов =  Новый ХранилищеЗначения(ОбщегоНазначения.ЗначениеИзСтрокиXML(Объект.ОтборыПоУмолчанию[ИндексСтроки].Настройки),Новый СжатиеДанных(9));
	КонецЦикла;
	
	// Таблица отборы по торговым площадкам
	Для ИндексСтроки = 0 По Объект.ОтборыИнвентаризации.Количество()-1 Цикл 
		ТекущийОбъект.ОтборыИнвентаризации[ИндексСтроки].ХранилищеОтборов =  Новый ХранилищеЗначения(ОбщегоНазначения.ЗначениеИзСтрокиXML(Объект.ОтборыИнвентаризации[ИндексСтроки].Настройки),Новый СжатиеДанных(9));
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Таблица основные отборы
	Для ИндексСтроки = 0 По ТекущийОбъект.ОтборыПоУмолчанию.Количество()-1 Цикл 
		Объект.ОтборыПоУмолчанию[ИндексСтроки].Настройки = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекущийОбъект.ОтборыПоУмолчанию[ИндексСтроки].ХранилищеОтборов.Получить());
	КонецЦикла;
	
	// Таблица отборы по торговым площадкам
	Для ИндексСтроки = 0 По ТекущийОбъект.ОтборыИнвентаризации.Количество()-1 Цикл 
		Объект.ОтборыИнвентаризации[ИндексСтроки].Настройки = ОбщегоНазначения.ЗначениеВСтрокуXML(ТекущийОбъект.ОтборыИнвентаризации[ИндексСтроки].ХранилищеОтборов.Получить());
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ГрафикТорговыхОбъектовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущаяСтрока = Элементы.ГрафикТорговыхОбъектов.ТекущиеДанные;	
		ТекущаяСтрока.Ключ = Новый УникальныйИдентификатор;
		ТекущийКлюч = ТекущаяСтрока.Ключ;
	КонецЕсли;

	// Вставить содержимое обработчика.
КонецПроцедуры




&НаКлиенте
Процедура УстановитьВидимостьОтбора(флВидимость)
	
	Если флВидимость Тогда
		Элементы.ГруппаОтборОсн.Видимость = Ложь;
		Элементы.ГруппаОтборТП.Видимость = Истина;
	Иначе
		Элементы.ГруппаОтборОсн.Видимость = Истина;
		Элементы.ГруппаОтборТП.Видимость = Ложь;
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура ГрафикТорговыхОбъектовПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ГрафикТорговыхОбъектов.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКлюч = ТекущаяСтрока.Ключ;

	
	Отбор = Новый ФиксированнаяСтруктура("Ключ", ТекущаяСтрока.Ключ);

	
	Элементы.ОтборыИнвентаризации.ОтборСтрок = Отбор;
	
	НайденоСтрок = Объект.ОтборыИнвентаризации.НайтиСтроки(Новый Структура("Ключ",ТекущаяСтрока.Ключ));
	УстановитьВидимостьОтбора(НайденоСтрок.Количество()>0);
	
		
	
КонецПроцедуры



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти


&НаКлиенте
Процедура ДобавитьНастройкуПоУмолчанию(Команда)
	
	
	пСтруктура = Новый Структура;
	ОткрытьФорму("Документ.ТК_ГрафикИнвентаризаций.Форма.ФормаОтбора",пСтруктура,Элементы.ОтборыПоУмолчанию,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытиеФормыОтбора(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
		
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборыПоУмолчаниюОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработатьОтборыПоУмолчаниюВыборНаСервере(ВыбранноеЗначение);   
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтборыПоУмолчаниюВыборНаСервере(АдресВременногоХранилища)
	
	стрВыбор =  ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Если стрВыбор.Свойство("ИдентификаторСтроки") Тогда
		стрОтбор = Объект.ОтборыПоУмолчанию.НайтиПоИдентификатору(стрВыбор.ИдентификаторСтроки);
	Иначе
		стрОтбор = Объект.ОтборыПоУмолчанию.Добавить();
	КонецЕсли;
	
	стрОтбор.Наименование = стрВыбор.Наименование;
	стрОтбор.ТипСклада = стрВыбор.ТипСклада;
	стрОтбор.Настройки = стрВыбор.Настройки;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОтборыИнвентаризацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	ОбработатьОтборыИнвентаризацииВыборНаСервере(ВыбранноеЗначение);  
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтборыИнвентаризацииВыборНаСервере(АдресВременногоХранилища) 
	
	стрВыбор =  ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Если стрВыбор.Свойство("ИдентификаторСтроки") Тогда
		стрОтбор = Объект.ОтборыИнвентаризации.НайтиПоИдентификатору(стрВыбор.ИдентификаторСтроки);
	Иначе
		стрОтбор = Объект.ОтборыИнвентаризации.Добавить();
	КонецЕсли;
	
	стрОтбор.Ключ = ТекущийКлюч;
	стрОтбор.ТорговаяПлощадка = ТекущаяТП;
	стрОтбор.Наименование = стрВыбор.Наименование;
	стрОтбор.ТипСклада = стрВыбор.ТипСклада;
	стрОтбор.Настройки = стрВыбор.Настройки;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОтборыПоУмолчаниюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОтборыПоУмолчанию.ТекущиеДанные;

	пСтруктура = Новый Структура;
	пСтруктура.Вставить("Наименование",ТекущаяСтрока.Наименование);
	пСтруктура.Вставить("ТипСклада",ТекущаяСтрока.ТипСклада);
	пСтруктура.Вставить("ИдентификаторСтроки",ТекущаяСтрока.ПолучитьИдентификатор());
	пСтруктура.Вставить("Настройки",ТекущаяСтрока.Настройки);
	
	ОткрытьФорму("Документ.ТК_ГрафикИнвентаризаций.Форма.ФормаОтбора",пСтруктура,Элементы.ОтборыПоУмолчанию,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьОтборТП(Команда)
	
	УстановитьВидимостьОтбора(Истина);
	ТекущаяСтрокаТП = Элементы.ГрафикТорговыхОбъектов.ТекущиеДанные;	
	
	ТекущаяТП = ТекущаяСтрокаТП.ТорговаяПлощадка; 	
	пСтруктура = Новый Структура;
	ОткрытьФорму("Документ.ТК_ГрафикИнвентаризаций.Форма.ФормаОтбора",пСтруктура,Элементы.ОтборыИнвентаризации,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыИнвентаризацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ОтборыИнвентаризации.ТекущиеДанные;

	пСтруктура = Новый Структура;
	пСтруктура.Вставить("Наименование",ТекущаяСтрока.Наименование);
	пСтруктура.Вставить("ТипСклада",ТекущаяСтрока.ТипСклада);
	пСтруктура.Вставить("ИдентификаторСтроки",ТекущаяСтрока.ПолучитьИдентификатор());
	пСтруктура.Вставить("Настройки",ТекущаяСтрока.Настройки);
	
	ОткрытьФорму("Документ.ТК_ГрафикИнвентаризаций.Форма.ФормаОтбора",пСтруктура,Элементы.ОтборыИнвентаризации,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры



// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
&НаКлиенте
Процедура ЗагрузитьГрафикИзФайла(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "ТК_ГрафикИнвентаризаций.ГрафикТорговыхОбъектов";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка Графика из файла'; uk = 'Завантаження Графика із файлу'");		
	//ПараметрыЗагрузки.ДополнительныеПараметры = Новый структура;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьГрафикИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);

КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьГрафикИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
    
    Если АдресЗагруженныхДанных = Неопределено Тогда 
        Возврат;
    КонецЕсли;
    
    ЗагрузитьГрафикИзФайлаЗавершениеНаСервере(АдресЗагруженныхДанных);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьГрафикИзФайлаЗавершениеНаСервере(АдресЗагруженныхДанных)
    
    ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	

	Если ЗагруженныеДанные.Количество()= 0 Тогда
		Возврат;
	Иначе
		Объект.ГрафикТорговыхОбъектов.Очистить();
		Объект.ОтборыИнвентаризации.Очистить();
		Модифицированность = Истина;
	КонецЕсли;
	
	
	
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл         
		
		НоваяСтрокаТовары = Объект.ГрафикТорговыхОбъектов.Добавить();
		НоваяСтрокаТовары.Дата = СтрокаТаблицы.Дата;
		НоваяСтрокаТовары.ТорговаяПлощадка = СтрокаТаблицы.ТорговаяПлощадка;
		НоваяСтрокаТовары.Ключ = Новый УникальныйИдентификатор();
		
	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
